Revit 2024 API
FilterGlobalParameterAssociationRule Properties
The FilterGlobalParameterAssociationRule type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from FilterRule.)
RuleValue
 The user-supplied global parameter value against which values from a Revit document will be tested.
See Also
FilterGlobalParameterAssociationRule Class
Autodesk.Revit.DB Namespace